In [6]:
import pandas as pd
import numpy as np

In [9]:
s= pd.Series([10.5, 12.5, 14.5, 16.5])

In [10]:
y= pd.Series([10.5, 12.5, 14.5, 16.5],name='height')

print (y)

0    10.5
1    12.5
2    14.5
3    16.5
Name: height, dtype: float64

In [11]:
h= pd.Series([10.5, 12.5, 14.5, 16.5],name='height',index=['a','b','c','d'])

print(h)

a    10.5
b    12.5
c    14.5
d    16.5
Name: height, dtype: float64

In [17]:
h.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
population={'Nairobi':10000, 'Kisumu': 15000, 'Kitale': 20000}
type(population)

dict

In [15]:
pop=pd.Series(population)
pop

Nairobi    10000
Kisumu     15000
Kitale     20000
dtype: int64

In [16]:
pop.values

array([10000, 15000, 20000])

DataFrame

In [18]:
Area={'Nairobi':200, 'Kisumu': 150, 'Kitale':100}
Area

{'Nairobi': 200, 'Kisumu': 150, 'Kitale': 100}

In [19]:
region=pd.DataFrame({"pop":population,"cubic_metres": Area})
print(region)

           pop  cubic_metres
Nairobi  10000           200
Kisumu   15000           150
Kitale   20000           100

In [26]:
data={"Name":['Annah','Aliyah','Lucy'],
       "Module":['python','pandas','Numpy'],
       "score":[78,90,60]}

In [27]:
df = pd.DataFrame(data)
print(df)

     Name  Module  score
0   Annah  python     78
1  Aliyah  pandas     90
2    Lucy   Numpy     60

In [22]:
df.head(2)

     Name  Module
0   Annah  python
1  Aliyah  pandas

In [23]:
df.tail(2)

     Name  Module
1  Aliyah  pandas
2    Lucy   Numpy

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Module  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [28]:
df.describe()

           score
count   3.000000
mean   76.000000
std    15.099669
min    60.000000
25%    69.000000
50%    78.000000
75%    84.000000
max    90.000000

In [29]:
df.dtypes

Name      object
Module    object
score      int64
dtype: object

Indexing and Selection

In [30]:
df

     Name  Module  score
0   Annah  python     78
1  Aliyah  pandas     90
2    Lucy   Numpy     60

In [32]:
df[['Name']]

     Name
0   Annah
1  Aliyah
2    Lucy

In [34]:
df[["Name","score"]]

     Name  score
0   Annah     78
1  Aliyah     90
2    Lucy     60

In [35]:
#iloc
df.iloc[0:2]

     Name  Module  score
0   Annah  python     78
1  Aliyah  pandas     90